In [ ]:
#Week_7 - Flagging Fraudulent Suspicions

In [1]:
import pandas as pd

Reading & Understanding all the datasets

In [2]:
trans_path = pd.read_csv("Transaction Path.csv")

In [3]:
trans_path.head(5)

   Transaction ID  Account_To  Account_From
0         1957155    27356852      76206810
1         2147025    44242297      24826358
2         3065073    10295384      52104303
3         6622100    45519330      69315008
4        14877473    28680375      44586370

In [4]:
trans_path.shape

(8781, 3)

In [5]:
trans_path.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  8781 non-null   int64
 1   Account_To      8781 non-null   int64
 2   Account_From    8781 non-null   int64
dtypes: int64(3)
memory usage: 205.9 KB

In [6]:
trans_det = pd.read_csv("Transaction Detail.csv")

In [7]:
trans_det.head(5)

   Transaction ID Transaction Date   Value Cancelled?
0         1957155       2023-02-01  128.78          N
1        28234510       2023-02-01  163.82          N
2        33688648       2023-02-01   54.71          N
3        41670299       2023-02-01   88.10          N
4        42825784       2023-02-01  217.22          Y

In [8]:
trans_det.shape

(8781, 4)

In [9]:
trans_det.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8781 entries, 0 to 8780
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8781 non-null   int64
 1   Transaction Date  8781 non-null   object
 2   Value             8781 non-null   float64
 3   Cancelled?        8781 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 274.5+ KB

In [ ]:
Observations:
    1. 'Transaction Date' is in object datatype

In [10]:
acc_info = pd.read_csv("Account Information.csv")

In [11]:
acc_info.head(5)

   Account Number Account Type   Account Holder ID Balance Date  Balance
0        10005367     Platinum            70390615   2023-01-31   728.25
1        10011977        Basic            20123998   2023-01-31   676.54
2        10024680     Platinum            54374080   2023-01-31   567.46
3        10031238        Basic            97027297   2023-01-31   576.52
4        10034341        Joint  89920386, 97325900   2023-01-31   390.39

In [12]:
acc_info.shape

(3000, 5)

In [13]:
acc_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account Number     3000 non-null   int64
 1   Account Type       3000 non-null   object
 2   Account Holder ID  3000 non-null   object
 3   Balance Date       3000 non-null   object
 4   Balance            3000 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 117.3+ KB

In [ ]:
Observations:
    1. 'Account Holder ID' is in object data type - should be 'int'
    2. 'Balance Date' is in object data type - should be 'Date'

In [15]:
acc_hold = pd.read_csv("Account Holders.csv")

In [16]:
acc_hold.head(5)

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address
0,70390615,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park
1,20123998,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza
2,54374080,Giraldo Kimbley,22/03/1995,7489940612,93005 Summer Ridge Avenue
3,97027297,Blake Dudson,30/06/1955,7253587445,2 Huxley Hill
4,89920386,Ajay Douce,19/12/1930,7395580534,90176 Miller Alley

In [17]:
acc_hold.shape

(3072, 5)

In [18]:
acc_hold.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3072 entries, 0 to 3071
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Account Holder ID      3072 non-null   int64
 1   Name                   3072 non-null   object
 2   Date of Birth          3072 non-null   object
 3   Contact Number         3072 non-null   int64
 4   First Line of Address  3072 non-null   object
dtypes: int64(2), object(3)
memory usage: 120.1+ KB

In [ ]:
For the Transaction Path table:
  Make sure field naming convention matches the other tables
  i.e. instead of Account_From it should be Account From

In [19]:
trans_path.head(5)

   Transaction ID  Account_To  Account_From
0         1957155    27356852      76206810
1         2147025    44242297      24826358
2         3065073    10295384      52104303
3         6622100    45519330      69315008
4        14877473    28680375      44586370

In [20]:
trans_path.rename(columns = {'Account_From' : 'Account From'} ,inplace = True)

In [21]:
trans_path.head(5)

   Transaction ID  Account_To  Account From
0         1957155    27356852      76206810
1         2147025    44242297      24826358
2         3065073    10295384      52104303
3         6622100    45519330      69315008
4        14877473    28680375      44586370

For the Account Information table:
 - Make sure there are no null values in the Account Holder ID
 - Ensure there is one row per Account Holder ID
      Joint accounts will have 2 Account Holders, we want a row for each of them

In [22]:
acc_info.head(5)

   Account Number Account Type   Account Holder ID Balance Date  Balance
0        10005367     Platinum            70390615   2023-01-31   728.25
1        10011977        Basic            20123998   2023-01-31   676.54
2        10024680     Platinum            54374080   2023-01-31   567.46
3        10031238        Basic            97027297   2023-01-31   576.52
4        10034341        Joint  89920386, 97325900   2023-01-31   390.39

In [23]:
acc_info.isnull().sum()

Account Number       0
Account Type         0
Account Holder ID    0
Balance Date         0
Balance              0
dtype: int64

In [24]:
acc_info['Account Holder ID'] = acc_info['Account Holder ID'].str.split(',')

In [25]:
acc_info = acc_info.explode('Account Holder ID')

In [26]:
acc_info

      Account Number Account Type Account Holder ID Balance Date  Balance
0           10005367     Platinum          70390615   2023-01-31   728.25
1           10011977        Basic          20123998   2023-01-31   676.54
2           10024680     Platinum          54374080   2023-01-31   567.46
3           10031238        Basic          97027297   2023-01-31   576.52
4           10034341        Joint          89920386   2023-01-31   390.39
...              ...          ...               ...          ...      ...
2996        99760030         Gold          66659633   2023-01-31   988.00
2997        99791709         Gold          94872412   2023-01-31    15.05
2998        99877007        Basic          90069774   2023-01-31   582.00
2999        99937043        Joint          45810412   2023-01-31   918.42
2999        99937043        Joint          83107272   2023-01-31   918.42

[3072 rows x 5 columns]

In [27]:
acc_info.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3072 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Account Number     3072 non-null   int64
 1   Account Type       3072 non-null   object
 2   Account Holder ID  3072 non-null   object
 3   Balance Date       3072 non-null   object
 4   Balance            3072 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 144.0+ KB

In [28]:
acc_info['Account Holder ID'] = acc_info['Account Holder ID'].astype(int)

For the Account Holders table:
  Make sure the phone numbers start with 07

In [29]:
acc_hold.head(5)

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address
0,70390615,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park
1,20123998,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza
2,54374080,Giraldo Kimbley,22/03/1995,7489940612,93005 Summer Ridge Avenue
3,97027297,Blake Dudson,30/06/1955,7253587445,2 Huxley Hill
4,89920386,Ajay Douce,19/12/1930,7395580534,90176 Miller Alley

In [30]:
acc_hold['Contact Number'] = acc_hold['Contact Number'].replace('^7','07')

In [31]:
acc_hold

,Account Holder ID,Name,Date of Birth,Contact Number,First Line of Address
0,70390615,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park
1,20123998,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza
2,54374080,Giraldo Kimbley,22/03/1995,7489940612,93005 Summer Ridge Avenue
3,97027297,Blake Dudson,30/06/1955,7253587445,2 Huxley Hill
4,89920386,Ajay Douce,19/12/1930,7395580534,90176 Miller Alley
...,...,...,...,...,...
3067,66659633,Mata Brownett,16/07/1931,7314541365,5 Kenwood Park
3068,94872412,Tabby Matteotti,13/10/1962,7586210387,7517 Aberg Plaza
3069,90069774,Cyndia Fosse,09/03/1961,7494132554,42 Trailsway Point
3070,45810412,Arch Segrave,05/06/2000,7289510957,14 3rd Center
3071,83107272,Niko Rudderham,11/12/2003,7312463759,14 3rd Center

Bring the tables together

In [32]:
trans_path.columns

Index(['Transaction ID', 'Account_To', 'Account From'], dtype='object')

In [33]:
trans_det.columns

Index(['Transaction ID', 'Transaction Date', 'Value', 'Cancelled?'], dtype='object')

In [34]:
print(trans_path.shape)
print(trans_det.shape)

(8781, 3)
(8781, 4)

In [35]:
trans_data = trans_path.merge(trans_det,how = 'inner',on = 'Transaction ID')

In [36]:
trans_data.head(3)

,Transaction ID,Account_To,Account From,Transaction Date,Value,Cancelled?
0,1957155,27356852,76206810,2023-02-01,128.78,N
1,2147025,44242297,24826358,2023-02-09,170.19,N
2,3065073,10295384,52104303,2023-02-06,87.57,N

In [37]:
print(acc_info.columns)
print(acc_hold.columns)

Index(['Account Number', 'Account Type', 'Account Holder ID', 'Balance Date',
       'Balance'],
      dtype='object')
Index(['Account Holder ID', 'Name', 'Date of Birth', 'Contact Number',
       'First Line of Address'],
      dtype='object')

In [38]:
print(acc_info.shape)
print(acc_hold.shape)

(3072, 5)
(3072, 5)

In [39]:
acc_data = acc_info.merge(acc_hold,how = 'inner',on = 'Account Holder ID')

In [40]:
acc_data.head(3)

,Account Number,Account Type,Account Holder ID,Balance Date,Balance,Name,Date of Birth,Contact Number,First Line of Address
0,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park
1,10011977,Basic,20123998,2023-01-31,676.54,Maynord Surgeoner,21/08/1997,7716107305,6422 Buena Vista Plaza
2,10024680,Platinum,54374080,2023-01-31,567.46,Giraldo Kimbley,22/03/1995,7489940612,93005 Summer Ridge Avenue

In [41]:
print(trans_data.columns)
print(acc_data.columns)

Index(['Transaction ID', 'Account_To', 'Account From', 'Transaction Date',
       'Value', 'Cancelled?'],
      dtype='object')
Index(['Account Number', 'Account Type', 'Account Holder ID', 'Balance Date',
       'Balance', 'Name', 'Date of Birth', 'Contact Number',
       'First Line of Address'],
      dtype='object')

In [42]:
trans_data.rename(columns = {'Account From':'Account Number'} , inplace = True)

In [43]:
final = acc_data.merge(trans_data, how = 'inner', on = 'Account Number')

In [44]:
final.head(5)

,Account Number,Account Type,Account Holder ID,Balance Date,Balance,Name,Date of Birth,Contact Number,First Line of Address,Transaction ID,Account_To,Transaction Date,Value,Cancelled?
0,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park,1711864935,43772330,2023-02-08,65.49,N
1,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park,1753186544,65199307,2023-02-02,1097.60,N
2,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park,3011215596,44427272,2023-02-05,108.26,N
3,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park,8072094629,34681193,2023-02-04,67.01,N
4,10005367,Platinum,70390615,2023-01-31,728.25,Mahmoud Hehnke,28/08/1995,7479286250,18535 Loftsgordon Park,9755066160,39620163,2023-02-10,27.61,N

In [45]:
final.shape

(8975, 14)

1. Filter out cancelled transactions 

2. Filter out Platinum accounts

In [46]:
final_1 = final[(final['Cancelled?'] == 'N') & (final['Account Type']!= 'Platinum')]

In [47]:
final_1.shape

(7567, 14)

In [48]:
final_1=final_1[final_1['Value'] > 1000]

In [49]:
final_1.columns

Index(['Account Number', 'Account Type', 'Account Holder ID', 'Balance Date',
       'Balance', 'Name', 'Date of Birth', 'Contact Number',
       'First Line of Address', 'Transaction ID', 'Account_To',
       'Transaction Date', 'Value', 'Cancelled?'],
      dtype='object')

In [50]:
cols = ['Transaction ID','Account_To','Transaction Date','Value','Name','Date of Birth','Contact Number','First Line of Address',
       'Account Number','Account Type','Balance Date','Balance']

In [51]:
final_1.reindex(columns = cols)

,Transaction ID,Account_To,Transaction Date,Value,Name,Date of Birth,Contact Number,First Line of Address,Account Number,Account Type,Balance Date,Balance
33,4230172990,68315462,2023-02-09,1410.1,Federico Cathro,13/12/1985,7283906757,12 Green Hill,10231977,Basic,2023-01-31,61.63
37,7252109585,69344396,2023-02-02,1190.9,Kizzee Puddephatt,18/10/2003,7598835878,72404 Maywood Avenue,10232603,Gold,2023-01-31,732.55
38,9161410454,91972687,2023-02-10,1128.4,Kizzee Puddephatt,18/10/2003,7598835878,72404 Maywood Avenue,10232603,Gold,2023-01-31,732.55
43,7934676808,69664627,2023-02-12,1482.9,Kalvin Duetschens,27/03/1965,7727619510,19032 Duke Parkway,10243581,Gold,2023-01-31,104.27
65,108536548,86207903,2023-02-06,1085.4,Dud Gaunt,04/12/1983,7681115087,3 Canary Avenue,10553619,Basic,2023-01-31,756.20
...,...,...,...,...,...,...,...,...,...,...,...,...
8951,908048920,97294152,2023-02-01,1194.4,Kerrill Dunstan,18/02/1952,7605122700,921 Merrick Way,99729369,Basic,2023-01-31,751.01
8954,5567411537,71383376,2023-02-03,1619.6,Kerrill Dunstan,18/02/1952,7605122700,921 Merrick Way,99729369,Basic,2023-01-31,751.01
8955,4286864758,42726921,2023-02-12,1342.4,Jana Sibthorp,02/03/1938,7302718672,48 Sutteridge Plaza,99734848,Gold,2023-01-31,354.29
8957,202263606,22035411,2023-02-02,1028.8,Mata Brownett,16/07/1931,7314541365,5 Kenwood Park,99760030,Gold,2023-01-31,988.00
8962,8811694280,25510430,2023-02-06,1359.0,Tabby Matteotti,13/10/1962,7586210387,7517 Aberg Plaza,99791709,Gold,2023-01-31,15.05

In [52]:
final_1.to_csv("Week_7_output.csv")